{
    "Examples": [
    {
      "name": "E1: Sampling, Reliability and Sensitivity Analysis of a Shear Building",
      "description": "This example takes a brief look at uncertainty quantification in a three-story shear frame subjected to earthquake loading.",
      "inputFile": "eeuq-0001/src/input.json"
    },	
    {
      "name": "E2: Site Response Analysis with Spatial Variability",
      "description": "This page shows two examples of how to incorporate spatial variability into UQ analysis by using various materials, namely ElasticIsotropic, PM4Sand, and PDMY03, in the Site Response option under EVENT tab.",
      "inputFile": "eeuq-0002/src/input.json"
    },
    {
      "name": "E3: PEER Ground Motion Selection and Nonlinear Response Analysis",
      "description": "This example shows how to select ground motion records and run nonlinear time history analysis for the OpenSees/tcl model of interest.",
      "inputFile": "eeuq-0003/src/input.json"
    },	
    {
      "name": "E4: AutoSDA and Nonlinear Response Analysis",
      "description": "This example demonstrates the use of a python-based computation platform to automate seismic design and analysis of steel moment resisting frames (AutoSDA) ([GBS20]).",
      "inputFile": "eeuq-0004/src/input.json"
    },	
    {
      "name": "E5: Synthetic Ground Motion Applied to a Shear Buildilng",
      "description": "This example considers the problem of uncertainty quantification in a three-story shear building where the ground shaking is represented by synthetic ground motion records based on two methods: Vlachos, Papakonstantinou and Deodatis (2018), and Dabaghi and Der Kiureghian (2018).",
      "inputFile": "eeuq-0005/src/input.json"
    },
    {
      "name": "E6: PLoM Surrogate Model",
      "description": "This example demonstrates using a novel method, Probabilistic Learning on Manifolds (PLoM), to develop surrogate models for structural responses under earthquake ground motion inputs.",
      "inputFile": "eeuq-0006/src/input.json"
    }
    ,
    {
      "name": "E7: Target Spectrum by Surrogate Hazard GP Model",
      "description": "This example demonstrates using a pre-trained Gaussian Process (GP) model to get target response spectrum for ground motion selection and scaling.",
      "inputFile": "eeuq-0007/src/input.json"
    },
    {
      "name": "E8: Using Multiple Modeling and Analysis Options",
      "description": "This example demonstrates how to use multiple modeling and simulation options within a single analysis in EE-UQ.",
      "inputFile": "eeuq-0008/src/input.json"
    }
    ,
    {
      "name": "E9: Training GP Surrogate Model",
      "description": "This example demonstrates how to develop surrogate models for seismic structural responses.",
      "inputFile": "eeuq-0009/src/input.json"
    }
    ,
    {
      "name": "E10: Prediction from GP Surrogate Model",
      "description": "This example uses pre-trained GP to obtain statistics for seismic structural responses.",
      "inputFile": "eeuq-0010/src/input.json"
    }
    ,
    {
      "name": "E11: Multi-fidelity Monte Carlo",
      "description": "This example uses a low-fidelity model to inform high-fidelity response statistics",
      "inputFile": "eeuq-0011/src/input.json"
    },
    {
      "name": "E12: Seismic Wave Basin Effects Model (DRM Example)",
      "description": "This example demonstrates the effect of a semi-hemispherical sedimentary basin on seismic wave propagation using the Domain Reduction Method (DRM) in EE-UQ, based on Femora Example 3.",
      "inputFile": "eeuq-0012/src/input.json"
    }
    ,
    {
      "name": "E13: Full 3D SSI Model with Laminar and DRM Inputs",
      "description": "A full 3D SSI model of a 10-story steel frame with elastic soil layers, demonstrated with two input options: laminar/perimeter (PEER record) and DRM (predefined DesignSafe H5DRM).",
      "inputFile": "eeuq-0013/input_laminar.json"
    }
  ]
}
